Workspace/test_cases/vertificating/Acoustic-test/NonLinearAcoustic/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 201325;

boundaryField
{
	fixedWalls
	{
		type	zeroGradient;
	}
	
	inlet
	{	
		type	uniformTotalPressure;
		p0	table
		(
//sine wave frequency of 30Hz and amplitude of 200,000 Pa
//adjusted pressure by 100000pa to avoid negative numbers
//(time amplitude)	
(0 201325)
(0.001 238801.262917145)
(0.002 274949.910536936)
(0.003 308490.358995799)
(0.004 338234.421185738)
(0.005 363128.398874989)
(0.006 382290.410493204)
(0.007 395041.632225726)
(0.008 400930.345685654)
(0.009 399747.940262896)
(0.01 391536.303259031)
(0.011 376586.336008773)
(0.012 355427.648555158)
(0.013 328809.797949738)
(0.014 297675.734820343)
(0.015 263128.398874989)
(0.016 226391.646712861)
(0.017 188766.896094137)
 (0.018 151587.022567029)
 (0.019 116169.141686985)
 (0.02 83767.9495415051)
 (0.021 55531.2745157174)
 (0.022 32459.4148995968)
 (0.023 15369.7028223496)
 (0.024 4867.5498542622)
 (0.025 1325)
 (0.026 4867.5498542624)
 (0.027 15369.7028223499)
 (0.028 32459.4148995973)
 (0.029 55531.2745157181)
 (0.03 83767.9495415059)
 (0.031 116169.141686986)
 (0.032 151587.02256703)
 (0.033 188766.896094138)
 (0.034 226391.646712862)
 (0.035 263128.39887499)
 (0.036 297675.734820344)
 (0.037 328809.797949738)
 (0.038 355427.648555158)
 (0.039 376586.336008773)
 (0.04 391536.303259031)
 (0.041 399747.940262896)
 (0.042 400930.345685654)
 (0.043 395041.632225726)
 (0.044 382290.410493204)
 (0.045 363128.398874989)
 (0.046 338234.421185737)
 (0.047 308490.358995798)
 (0.048 274949.910536935)
 (0.049 238801.262917144)
 (0.05 201324.999999999)
 (0.051 163848.737082854)
 (0.052 127700.089463063)
 (0.053 94159.6410041995)
 (0.054 64415.5788142614)
 (0.055 39521.6011250097)
 (0.056 20359.5895067955)
 (0.057 7608.3677742735)
 (0.058 1719.6543143456)
 (0.059 2902.0597371046)
 (0.06 11113.6967409697)
 (0.061 26063.663991228)
 (0.062 47222.3514448432)
 (0.063 73840.2020502631)
 (0.064 104974.265179658)
 (0.065 139521.601125012)
 (0.066 176258.353287141)
 (0.067 201325)
);
outOfBounds clamp;
}

outlet 
    {
      type               zeroGradient;
    }
 
  frontAndBack
    {
      type empty; 
    }
}




