Workspace/test_cases/vertificating/Acoustic-test/NonLinearAcoustic/Allrun
#!/bin/sh

. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication decomposePar
runParallel $(getApplication)
runApplication reconstructPar

